tests/nfr/artillery/checkHomepage.yml
config:
  target: 'https://par-beta-staging.cloudapps.digital'
  phases:
    - duration: 30
      arrivalRate: 5
    - duration: 60
      arrivalRate: 5
      rampTo: 25
    - duration: 120
      arrivalRate: 10
  payload:
    path: "keywords.csv"
    fields:
      - "keywords"
scenarios:
  - name: "Search and filter"
    flow:
      - post:
          url: "/dv/rd-dashboard"
          body: "keywords={{ keywords }}"
          capture:
            json: "$.results[0].id"
            as: "id"
      - think: 3
      - get:
          url: "/dv/primary-authority-partnerships/33084"